CSI API ETABS v1
cAreaObj.SetGUID Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGUID(
	string Name,
	string GUID = ""
)
Function SetGUID (
	Name As String,
	Optional GUID As String = ""
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetGUID(Name, GUID)
int SetGUID(
	String^ Name,
	String^ GUID = L""
)
abstract SetGUID :
        Name : string *
        ?GUID : string
(* Defaults:
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
GUID (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace